from collision.collision import *

print("###########################################################################################")

print("Существует ли прямоуг. (-3.4, 1), (9.2, 10) (должен): ", isCorrectRect([(-3.4, 1),(9.2, 10)])) #Вызов функции проверки прямоугольника, который возвращает True

print("Существует ли прямоуг. (-7, 9), (3, 6) (не должен):", isCorrectRect([(-7, 9),(3, 6)]))  #Вызов функции проверки прямоугольника, который возвращает False

print("===========================================================================================")

print("Соприкасаются ли прямоуг. (-3.4, 1),(9.2, 10) и (-7.4, 0),(13.2, 12) (должны): ", isCollisionRect([(-3.4, 1),(9.2, 10)], [(-7.4, 0),(13.2, 12)])) #Вызов функции проверки соприкосновения, которая возвращает True

print("Соприкасаются ли прямоуг. (1, 1),(2, 2) и (3, 0),(13, 1) (не должны): ", isCollisionRect([(1, 1),(2, 2)], [(3, 0),(13, 1)])) #Вызов функции проверки соприкосновения, которая возвращает False
print()

print ("isCollisionRect([(1, 1),(2, 2)], [(3, 17),(13, 1)]) вызовет исключение RectCorrectError(2):")    #Такие аргументы в функции вызвали бы исключение RectCorrectError(2)
try:
    isCollisionRect([(1, 1),(2, 2)], [(3, 17),(13, 1)])
except BaseException as exception:
    print("ОШИБКА:", exception)

print("===========================================================================================")

print("Площадь пересечения прямоуг. (-3, 1), (9, 10) и (-7, 0), (13, 12) (> 0): ", intersectionAreaRect([(-3, 1), (9, 10)], [(-7, 0), (13, 12)])) #Вызов функции вычисления площади пересечения прямоугольниковы, возвращающая положительное число

print("Площадь пересечения прямоуг. (1, 1), (2, 2) и (3, 0), (13, 1) (= 0): ", intersectionAreaRect([(1, 1), (2, 2)], [(3, 0), (13, 1)])) #Вызов функции вычисления площади пересечения прямоугольниковы, возвращающая 0
print()

print("intersectionAreaRect([(1, 1), (2, 2)], [(3, 17), (13, 1)]) вызовет исключение ValueError:")
try:
    intersectionAreaRect([(1, 1), (2, 2)], [(3, 17), (13, 1)])
except ValueError as exception:
    print("ОШИБКА:", exception)

print("===========================================================================================")

#Корректные прямоугольники
rectangles = [
    [(-3, 1), (9, 10)],
    [(-7, 0), (13, 12)],
    [(0, 0), (5, 5)],
    [(2, 2), (7, 7)]
]

#Второго прямоугольника не существует
incorrect_rectangles = [
    [(-3, 1), (9, 10)],
    [(3, 17), (13, 1)]
]

print("Уникальная площадь пересечения прямоуг. из списка rectangles: ", intersectionAreaMultiRect(rectangles))
print()

print("intersectionAreaMultiRect(incorrect_rectangles) вызовет исключение RectCorrectError(2):")
try:
    intersectionAreaMultiRect(incorrect_rectangles)
except BaseException as exception:
    print("ОШИБКА:", exception)

print("###########################################################################################")