from collision.collision import *

print("Существует ли прямоуг. (-3.4, 1), (9.2, 10) (должен): ", isCorrectRect([(-3.4, 1),(9.2, 10)])) #Вызов функции проверки прямоугольника, который возвращает True

print("Существует ли прямоуг. (-7, 9), (3, 6) (не должен):", isCorrectRect([(-7, 9),(3, 6)]))  #Вызов функции проверки прямоугольника, который возвращает False

print("===========================================================================================")

print("Соприкасаются ли прямоуг. (-3.4, 1),(9.2, 10) и (-7.4, 0),(13.2, 12) (должны): ", isCollisionRect([(-3.4, 1),(9.2, 10)], [(-7.4, 0),(13.2, 12)])) #Вызов функции проверки соприкосновения, которая возвращает True

print("Соприкасаются ли прямоуг. (1, 1),(2, 2) и (3, 0),(13, 1) (не должны): ", isCollisionRect([(1, 1),(2, 2)], [(3, 0),(13, 1)])) #Вызов функции проверки соприкосновения, которая возвращает False

print ("isCollisionRect([(1, 1),(2, 2)], [(3, 17),(13, 1)]) вызовет исключение RectCorrectError(2)")    #Такие аргументы в функции вызвали бы исключение RectCorrectError(2)

print("===========================================================================================")

