def disp_books():   #Функция с выводом на экран книг и информации о них
    for i in range(len(books)): #Вывод данных
        print(" ---------------------- Книга", i+1, "-----------------------")
        print(" Название:", books[i]["title"] + ", Автор:", books[i]["author"])
        print(" -------------------------" + str(books[i]["year"]) + "-------------------------\n")


books = [   #Словарь с книгами и информацией о них
    {"title": "Война и мир", "author": "Лев Толстой", "year": 1869},
    {"title": "Преступление и наказание", "author": "Фёдор Достоевский", "year": 1866},
    {"title": "Мастер и Маргарита", "author": "Михаил Булгаков", "year": 1967},
    {"title": "Три товарища", "author": "Эрих Мария Ремарк", "year": 1936},
    {"title": "Дом в котором", "author": "Мариам Петросян", "year": 2009}
]


disp_books()    #Вызов функции с выводом информации о книгах