books = [   #Словарь
    {"title": "Война и мир", "author": "Лев Толстой", "year": 1869},
    {"title": "Преступление и наказание", "author": "Фёдор Достоевский", "year": 1866},
    {"title": "Мастер и Маргарита", "author": "Михаил Булгаков", "year": 1967},
    {"title": "Три товарища", "author": "Эрих Мария Ремарк", "year": 1936},
    {"title": "Дом в котором", "author": "Мариам Петросян", "year": 2009}
]

for i in range(len(books)): #Вывод данных
    print(" ---------------------- Книга", i+1, "-----------------------")
    print(" Название:", books[i]["title"] + ", Автор:", books[i]["author"])
    print(" -------------------------" + str(books[i]["year"]) + "-------------------------\n")
